name: "sentiment"
backend: "python"

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "sent_arr"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  } 
]

instance_group [{ kind: KIND_GPU }]

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/home/condpackenv/transformers_env.tar.gz"}
}
